from propreg import *

PARTIES = {
    "Коммунистическая партия": {
        "print_name": "Коммунистическая\nпартия",
        "number": 1,
        "logo": "bulleten/parties/kom.png",
        "info": "Коммунистическая партия, выступающая за строгие интернет-правила и борьбу со спамом и флудом, за поддержку канала Кэсли через монтаж, озвучку и материалы, за создание Discord-канала для сплочения, за финансовую поддержку Кэсли через сборы, за больше совместных игр и интернет-мероприятий, за демократизацию модераторов через голосование участников и утверждение Кэсли, а также за полную свободу критики любой партии — включая доминирующую — без наказаний, кроме спама."
    },
    "Партия Василёк": {
        "print_name": "Партия\nВасилёк",
        "number": 2,
        "logo": "bulleten/parties/vas.png",
        "info": "Центристская партия с уклоном в либерализм, за нормальность в шуточной думе: свободу слова и мемов без банов за мнение при открытых голосованиях и без тайных договорённостей; за справедливость через честные выборы без накруток и админресурса, равные права для всех партий и защиту малых сил; за мир без травли, деанона и конфликтов, где споры решаются дебатами, а не оскорблениями."
    },
    "Партия Гласного Успеха": {
        "print_name": "Партия\nГласного Успеха",
        "number": 3,
        "logo": "bulleten/parties/pgu.png",
        "info":"Умеренная правоцентристская партия за гласность и реальное влияние каждого на политику КэсДумы: через модераторов во всех часовых поясах, бота для предложений и идей, независимый суд с апелляциями на баны и споры, должность премьер-министра как главы Думы и помощника Кэсли, пропорциональную Думу из 40 человек с 7% барьером, регулярные выборы раз в 3 месяца и принятие законов только через голосование чата. При этом ПГУ выступает за постепенное освобождение Кэсли от дел чата ради его личной жизни и роликов."
    },
    "Белая Полоса": {
        "print_name": "Белая Полоса",
        "number": 4,
        "logo": "bulleten/parties/bp.png",
        "info": "Левоцентристская партия с социал-демократическим уклоном, выступающая за свободные СМИ без согласований с администрацией, равные условия для всех политсил и открытые дебаты, за прозрачную КэсДуму с публичными протоколами и правом каждого предложить закон, за апелляции и отстранение модераторов-нарушителей, за политический баланс и право оппозиции быть услышанной, а также за активное развитие чата — новые тематические направления, мероприятия и подготовку администрации к росту онлайна."
    },
    # "Движуха": {
    #     "print_name": "Движуха",
    #     "number": 5,
    #     "logo": "bulleten/parties/dvij.png"
    # },
    "Чат.Будущее": {
        "print_name": "Чат.Будущее",
        "number": 6,
        "logo": "bulleten/parties/chat.png",
        "info": "Зонтичная правоцентристская партия, выступающая за идентичность сообщества КэсДумы, чёткие правила для участников и модераторов, прозрачную модерацию с правом обжалования и независимым судом, развитие актива через ивенты, конкурсы и поддержку инициатив, а также за разработку уникального бота и технологичное обновление чата — при этом за максимальную свободу общения без травли и за сообщество для всех, где власть служит народу, а не отдельным партиям."
    },
    "Социал-демократическая партия": {
        "print_name": "Социал-демократическая\nпартия",
        "number": 7,
        "logo": "bulleten/parties/socdem.png",
        "info": "Социал-демократическая партия, выступающая за демократию и соучастие через регулярные опросы и публичные предупреждения с объяснением причин, за нулевую толерантность к буллингу и дискриминации, понятные правила и поддержку в конфликтах, за доступность и инклюзивность с чёткой навигацией и адаптацией для новичков, за качественный контент от экспертов и обратную связь, за устойчивое развитие чата без спама и офтопа, где модерация — инструмент порядка, а не цензуры, а также за свободное, но разумное использование ИИ — особенно в агитации."
    },
    # "Либертарианская партия": {
    #     "print_name": "Либертарианская\nпартия",
    #     "number": 8,
    #     "logo": "bulleten/parties/librt.png"
    # },
    "Звезда": {
        "print_name": "Звезда",
        "number": 9,
        "logo": "bulleten/parties/zvezda.png",
        "info": "Крайне левая альткоммунистическая партия, выступающая за расширение и укрепление сообщества Кэсли через создание творческой студии, комитетов по музыке, рисункам, монтажу и хостингу, региональных отделений в городах и собственного сайта, а также за привлечение новых участников, их обучение и формирование управленческой структуры — с менеджером, секретарём, бухгалтером и маркетологом — ради организованного, творческого и массового развития сообщества."
    },
    "ОПФ Оболдуи": {
        "print_name": "ОПФ Оболдуи",
        "number": 10,
        "logo": "bulleten/parties/obold.png",
        "info": "Популистская партия за защиту прав гиков и участников фандомов в сообществе КэсДумы, за фандомизацию через видео о разных фандомах в собственном стиле, за формирование у канала КэсДумы собственного фандома с канонами и лором, за создание отдельного YouTube-канала КэсДумы с разделением 40 депутатов по комитетам контента — сценарий, арты, монтаж, озвучка и идеи — а также за бескомпромиссную борьбу с Lesbian Space Princess как интернет-явлением и солидарность с общефандомным движением против LSP."
    },
    "Против Всех": {
        "print_name": "Против Всех",
        "number": 11,
        "logo": "bulleten/parties/against.png"
    }
}

INVALID_BUL = 0

Results = {}
for party in PARTIES.keys():
    Results[party] = 0
    
def calculate_procent(party: str) -> float:
    if party not in Results:
        return 0.0
    sumvotes = sum(Results.values())
    sumvotes -= Results["Против Всех"]
    procent = Results[party]
    return round(procent/sumvotes*100,2)

def calculate_turnout() -> float:
    votecount = 0
    for user in users.values():
        if user["vote_id"] != None:
            votecount += 1
    return round(votecount/len(users),2)

def generate_voting_results() -> str:
    VOTING_RESULTS = f"\nЯвка - {calculate_turnout()*100}%\n"
    for party in list(Results.keys())[:-1]:
        VOTING_RESULTS += f"\n{party} - {calculate_procent(party)}%"
    VOTING_RESULTS += f"\n\nПротив всех - {calculate_procent('Против Всех')}% - {Results['Против Всех']} голосов"
    VOTING_RESULTS += f"\nНедействительные бюллетени- {round(INVALID_BUL/sum(Results.values())*100,2)}%"
    return VOTING_RESULTS

def generate_party_info(party: str):
    party_info = party.upper()+"\n"+PARTIES[party]["info"]
    return party_info